Revit 2027 API
DGNExportOptions.SeedName Property
 The name of the DGN seed. Default value of seedName is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SeedName { get; set; }
Public Property SeedName As String
	Get
	Set
public:
property String^ SeedName {
	String^ get ();
	void set (String^ value);
}
member SeedName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DGNExportOptions Class
Autodesk.Revit.DB Namespace